{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_1", "use_bias": true, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 64, "bias_constraint": null, "strides": [1, 1], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_2", "use_bias": true, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 64, "bias_constraint": null, "strides": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "dtype": "float32", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_3", "use_bias": true, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 64, "bias_constraint": null, "strides": [1, 1], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_4", "use_bias": true, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 64, "bias_constraint": null, "strides": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "dtype": "float32", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_5", "use_bias": true, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 128, "bias_constraint": null, "strides": [1, 1], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_6", "use_bias": true, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 128, "bias_constraint": null, "strides": [1, 1], "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "dtype": "float32", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"trainable": true, "dtype": "float32", "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "dense_1", "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 1024, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.2, "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "dense_2", "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "units": 1024, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "rate": 0.2, "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "dense_3", "use_bias": true, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "units": 7, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "trainable": true}}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.3.1"}